[
  {
    "id": 0,
    "heading":
      "Almost four years after UMD joined the Big Ten, students and alumni are learning to adapt",
    "author": " Jack Roscoe",
    "blurb":
      "It’s been more than five years since University of Maryland President Wallace Loh announced Nov. 19, 2012 that the university would leave the Atlantic Coast Conference for the Big Ten.<br /><br />This university joined the Big Ten on July 1, 2014. The class of 2018 didn’t see those electric home games against Duke as students — when the current seniors arrived, the controversial move meant it was time to form new rivalries across all sports against schools like Michigan State and Wisconsin. Today’s athletic department views the change in a more positive light than many students who went to this university when it was still in the ACC.<br /><br />“Our fanbase, our alumns, our donors, our constituents have adjusted and adapted and are excited about what we’ve been able to do and how we fit in,” executive athletic director Damon Evans said.<br /><br />Evans said joining the Big Ten was a good decision for the long-run growth of this university. <br /><br />It allowed the university access to resources from others in the conference through the Big Ten Academic Alliance, which gives shared access to library and IT resources. The Big Ten Network also broadcasts games to a wider audience, which gives this university more revenue to invest back into athletic programs, he said.<br /><br />“Kids want to play in the best conference, and right now it’s kind of tough to argue that the Big Ten’s not that,” said volleyball coach Adam Hughes.<br /><br />The increased visibility and competition that comes with the Big Ten conference is a “massive advantage” for this university, Hughes said. Before Hughes joined Maryland volleyball as an assistant coach in 2014, the average attendance for a volleyball game was about 300 people, he said. The team averaged about 1,<br /><br />    400 people per game in the 2017-18 season.<br /><br />“Some people probably were questioning how we would perform moving forward into the Big Ten,” Evans said. “We’ve been very successful.”<br /><br />Since joining the Big Ten, this university has won three national championships — two in women’s lacrosse and one in men’s lacrosse— and 25 Big Ten conference championships, Evans said. This ties Ohio State’s conference record and is second only to the University of Michigan since Maryland’s joining, he said.<br /><br />But this university is primarily a basketball school, said Dan Aburn, who graduated in 2015 with a journalism degree. Even though this university has done well in the Big Ten in other sports, the ACC was a better basketball conference, he said.<br /><br />“By moving to the Big Ten, you were almost moving to an inferior sporting conference,” Aburn said.<br /><br />Leaving the ACC also meant leaving men’s basketball games with Duke University and the University of North Carolina, which speech-language pathology graduate student Maria Binger said was what made her most upset with the decision to move.<br /><br />“All we had was our conference rivalries,” said Andy Levitt, who graduated from this university in 2005 with a criminology and criminal justice degree. “People like me will always miss those games against Duke or UNC.”<br /><br />Speech-language pathology graduate student Kerianna Frederick said she remembers waiting in line for 12 hours to get a good seat at the Duke game her freshman year.<br /><br />“We don’t have anything like that still, which is very sad because that was the highlight of my freshman year,” she said.<br /><br />Frederick said this university still hasn’t developed any new rivalries with teams in the Big Ten, and that it’s been hard to get hyped about playing teams the school has no history with.<br /><br />“I don’t care about Minnesota or Michigan State or Ohio State … I don’t care about playing those people,” Levitt said. “They don’t care about us either.”<br /><br />Senior psychology and criminology and criminal justice major Sydney Jolliffe said she grew up hating Duke, but never got to go to a basketball game between Duke and this university like she always dreamt of.<br /><br />“There will never really be anything like Duke and UNC,” Jolliffe said. “That’s something that I really looked forward to when I was coming here and now definitely miss.”<br /><br />Jolliffe said the move to the Big Ten hasn’t deterred her from being a basketball fan, but she’s still upset by the lack of tradition, even though she recognizes the financial benefits.<br /><br />This university belonging to the Big Ten and not the ACC still feels like being in someone else’s shoes, said Kenny Beck, who graduated from this university in 2002 with a journalism degree. He said winning more games would solve a lot of problems, though.<br /><br />“You’ve got to get that buzzer beater against Michigan State on the road and you’ve got to upset Indiana when they’re number one in the country,” Beck said, “you’ve got to do those kind of things for it to feel like home, to really cement some of those rivalries.”<br /><br />Evans said belonging to the Big Ten gives this university the platform to win big games against competitive teams and have more people see it.<br /><br />“We want people across the county to know who Maryland is, what we’re about,” Evans said. “Maryland pride needs to resonate across this country.”",
    "images": [
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/02/29021023/022815WBBvsMinnesota_Team_mkm02.jpg&mode=crop&w=1200&q=99",
        "caption":
          "The Terps pose with the Big Ten regular-season trophy after winning the conference title with a 110-77 win over Minnesota on Feb. 28, 2016 at Xfinity Center. (Marquise McKine/The Diamondback)"
      }
    ]
  },
  {
    "id": 1,
    "heading": "A look back at the movements that defined the past four years",
    "author": "Anna Muckerman",
    "blurb":
      "<a href=\"http://www.dbknews.com/archives/article_4c61d376-7412-11e4-b72c-77031654fd22.html\">Nov. 24, 2014: The shooting of Michael Brown</a><br /><br />During the class of 2018’s first year, a string of police killings involving black men pushed the campus into action. On Nov. 24, 2014 about 50 students marched from McKeldin Mall to the Main Administration Building with a sign that read “demilitarize UMD.” The march happened only a few hours before a grand jury decided not to indict the police officer charged with shooting Michael Brown of Ferguson, Missouri, in August of that year. At the administration building, University Police Chief David Mitchell answered questions and took a list of demands for university President Wallace Loh that included requiring campus police officers to wear body cameras.<br /><br />“President Loh having his background in law, he’s very talented at creating language … rhetoric that ‘oh I’m so proud of student leaders, stay [in your place] though,’” said Kosi Dunn, an individual studies major who was involved in campus activism at the time. “The moment you’re demanding things that conflict with the public research institution’s outcomes and goals, it becomes a really messy place. It’s disheartening.”<br /><br /><a href=\"http://www.dbknews.com/archives/article_b9ad0fdc-74de-11e4-91e7-43927461cd87.html\">Nov. 25, 2014: Stamp protest in light of Ferguson</a><br /><br />The next day, in light of the failed indictment, students organized a sit-in during which they refused to buy food from Stamp Student Union’s restaurants during the busy lunch period. Students linked arms and held a four and a half minute silence to remember Michael Brown, whose body lie on the ground in Ferguson for four and a half hours after he was shot. #OccupyStamp was trending in the Washington, D.C., area as students stood on table tops to share stories and frustrations.<br /><br />Looking back, Dunn, who will graduate in December, said he was “extremely disappointed” in the way that the university used the events to create visibility around student leaders without recognizing their demands. <br /><br />“I was inspired by the student activists at this time and was extremely disappointed and let down by the ways in which the administration sought to — through their language and the way the media wrapped around these events as a way to create visibility … around leaders,” he said. “There’s a disparity between the administrations goals and the students — we’re literally just advocating for our own safety and our own lives.”]<br /><br /><a href=\"http://www.dbknews.com/archives/article_11c2ae14-d404-11e4-9a95-fb69e12eea25.html\">March 27, 2015: Racist, sexist fraternity email</a><br /><br />After a racist, sexist email written by a member of the University of Maryland’s Kappa Sigma fraternity surfaced, students took to sidewalk on March 27, 2017 to raise their voices. Students argued the email represented a larger problem within the Greek community. Loh joined the Stamp sit-in, which then continued as a march to Kappa Sigma’s off-campus house. Students confronted Loh for not taking harsher action against those involved. They also demanded the renaming of Byrd Stadium.<br /><br /><a href=\"http://www.dbknews.com/archives/article_a5e129e6-8989-11e5-a09f-432d68a54632.html\">Nov. 12, 2015: Rally at Frederick Douglass</a><br /><br />During the nationwide movement to address racism on college campuses, about 200 students gathered at the newly installed Frederick Douglass statue. It was the first of several rallies that cemented the statue as a gathering place at this university. Students, many dressed in black, stood in solidarity as speakers addressed the racial tensions at Yale University and University of Missouri.<br /><br />“For us at the University of Maryland, as a predominately white institution, we’ve gone so far, and this is just another step forward of understanding hate,” Soulihe Nida, then a sophomore architecture major, said at the time of the demonstrations. “Placing this statue right here where students like us can walk through and understand, ‘Hey, this institution actually cares and represents what we are here for’ — it’s a great thing.”<br /><br /><a href=http://www.dbknews.com/archives/article_ca83a35e-8e58-11e5-9029-43405c18e033.html\">Nov. 18, 2015: Calls to change stadium name at Frederick Douglass Statue</a><br /><br />A few days later, minutes before the statue’s dedication ceremony, about 10 students took the stage to call for the renaming of Byrd Stadium, named for former university president Harry Clifton “Curley” Byrd, a known segregationist. Members of the Douglass family continued the ceremony soon after. Loh had formed a task force to look into renaming Byrd Stadium in September. In December, the Board of Regents voted to officially change the name to Maryland Stadium.<br /><br />“Momentum is building,” said Kenneth B. Morris Jr., Douglass’ great-great-great grandson. “Freedom’s torch has been passed down to us.”<br /><br /><a href=http://www.dbknews.com/2016/04/19/umd-students-sit-down-2-stand-up-against-sexual-assault/\">April 18, 2016: Sit Down 2 Stand Up against sexual assault </a><br /><br />Thousands of students attended the 12-hour joint event Occupy McKeldin and Sit Down 2 Stand Up to sexual assault. Survivors of sexual assault shared their stories including a woman who accused actor Bill Cosby of drugging and raping her in the ’90s. Students used the platform to raise awareness of lesser known issues including sexual assault in the LGBT community and against men. Others attended to show support for the cause.<br /><br /><a href=http://www.dbknews.com/2016/04/19/umd-students-sit-down-2-stand-up-against-sexual-assault/\">April 19, 2016: IsraelFest</a><br /><br />Students clashed with each other and police while protesting Israel Fest, an annual event. More than two dozen students marched and chanted in support of Palestine. Some lay down on the sidewalk, but police demanded they not block walkways, in accordance with university  guidelines for demonstrations. Students in support of Palestine said they intended to bring awareness to Israel’s “apartheid state.” Sara Goldstein, the vice president of the Jewsish Student Union at the time of the event,  said that the protesters did not have a right to disrupt their cultural event. <br /><br /><a href=http://www.dbknews.com/2016/11/18/umd-members-stage-walkout-solidarity-with-minorities/\">Nov. 17, 2016: Walkout after the election</a><br /><br />The week after a tumultuous election, students flooded McKeldin Mall to show support for minorities and marginalized groups. The walkout swelled to several hundred people as it moved from Testudo to the Main Administration Building and finally the Frederick Douglass statue. Students expressed fear and uncertainty in the face of Islamophobia and deportation talks. At the statue, students spread messages of hope and support and expressed a desire to build a community free of hate.<br /><br />“I came out because there’s a lot of problems going on — not just on campus — but in the world,” then-sophomore English major Kian Kelley-Chung said at the time. “We’re not just going to let bullshit happen. This shows we’re not standing for it.”<br /><br /><a href=http://www.dbknews.com/2017/02/02/umd-immigrant-refugee-rally/\">February 2, 2017: Trump's travel ban</a><br /><br />More than 200 people joined forces in the Students for Justice in Palestine’s protest of Trump’s travel ban on the steps of the Main Administration Building. Speakers demanded Loh fight the ban which he said in an email affected 350 university community members. The weekend before the protest, a student at this university was detained on her way back from visiting family in Turkey.<br /><br /><a href=http://www.dbknews.com/2017/05/11/protectumd-occupy-admin-protest/\">May 11, 2017: Protest after noose found in fraternity house</a><br /><br />ProtectUMD organized a rally of 100 students to bring demands to Loh after a noose was found in the Phi Kappa Tau fraternity house. Holding a sign that said #A[DIFFERENT]UMD, protesters called on the university to address several incidents targeting minorities at that time. Vice President for Student Affairs Linda Clement came out to address student concerns, but protesters began banging on the door after she went inside. Then, they marched to Loh’s University House, where police put up caution tape to keep them back.<br /><br />“[Clement] shouldn’t have come out,” Fatima Ahmed, then a junior public policy major, said at the time. “If Loh was here, he should have come out. He should be our voice. He should be the one speaking to us directly … He’s who we look up to. He’s our president.”<br /><br /><a href=http://www.dbknews.com/2017/05/25/a-precious-part-in-each-of-us-has-died-umd-community-remembers-richard-collins-iii/\">May 2017: Richard Collins memorial</a><br /><br />The killing of 2nd Lt. Richard Collins, a Bowie State student, rocked campus and sparked discussions about hate crimes as well as the definition of hate speech and the university’s ability to take action against it. Members of the campus community gathered in the chapel garden, where Chaplain Tarif Shraim led the service to remember Collins’ spirit and help the attendees heal. Before leaving, students placed flowers around photos of Collins and took a moment to reflect on the tragedy that continues to shape this university.<br /><br />“There’s a lot of people that don’t know what to do, and I don’t really know what to do either,” Harrison Bartlett, then a junior aerospace engineering major, said at the time. “But I think that this is a step, and I don’t think we can sit here and do nothing.”",
    "images": [
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=http://wp-dbknews.s3-website-us-east-1.amazonaws.com/images/2014/11/6fa5ed5f6ae03e6460ef31ec40996171.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=http://wp-dbknews.s3-website-us-east-1.amazonaws.com/images/2014/11/74590ccff253b8b6e1d8f99e191aae6d.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=http://wp-dbknews.s3-website-us-east-1.amazonaws.com/images/2015/03/6474329ee236e83437b184cb343ca94e.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=http://wp-dbknews.s3-website-us-east-1.amazonaws.com/images/2015/11/b2ecc4de6b681a9d7a128cfe737db153.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=http://wp-dbknews.s3-website-us-east-1.amazonaws.com/images/2015/11/cc4b7086aa873d103e4f5f4c044fcef3.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/04/19002358/041816_sd2su_tsh01.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/04/19221044/041916PalestineProtest_jcl_05.jpg&mode=crop&w=1200&q=99",
        "caption": ""
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/11/18013650/111716_Walkout_tsh01-e1479436504745.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Organizers of the ProtectUMD walkout lead chants in front of McKeldin Library on Nov. 17, 2016. (Tom Hausman/The Diamondback)"
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2017/02/02030559/020117_RefugeeRally_jcl03.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Sahar Shehata, then a sophomore mechanical engineering major, stands on the steps of the Main Administration Building as part of a 2017 on campus rally in solidarity with refugees. (Josh Loock/The Diamondback)"
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2017/05/11020745/outsideLohsHouse.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Demonstrators gather in front of the University House during a ProtectUMD protest on Wednesday, May 10, 2017. (Jay Reed/The Diamondback)"
      },
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2017/05/25011448/IMG_1022.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Hundreds gather at the University of Maryland's Memorial Chapel garden to honor Richard Collins III, who was killed on the campus on Saturday, May 20, 2017. (Natalie Schwartz/For The Diamondback)"
      }
    ]
  },
  {
    "id": 2,
    "heading":
      "The senior class had a tumultuous four years of Maryland football",
    "author": "Jordan Katz",
    "blurb":
      "Perhaps no game better summarizes the past four years of Maryland football better than the Terps’ matchup with Rutgers on Nov. 29, 2014. <br /><br />Maryland entered the game with a 7-4 record, and it was hard for anyone to argue the team’s first year in the Big Ten wasn’t successful. While the Terps struggled with powerhouses like Ohio State and Wisconsin, they had beaten Michigan and Penn State on the road. <br /><br />If they took care of business against Rutgers, they’d finish their inaugural Big Ten season with a winning record in conference play and their first eight-win season since 2010.<br /><br />At first, it looked like Maryland had it in the bag. With 2: 52 left in the first half, the Terps expanded their lead to 35-10. C.J. Brown had two touchdowns in the air and another on the ground, while Brandon Ross had 63 rushing yards and found the end zone twice. <br /><br />But from that moment on, Rutgers outscored Maryland 31-3 en route to a 41-38 victory. A month later, the Terps ended their season with back-to-back losses, looking listless as Stanford handily beat them in the Foster Farms Bowl.<br /><br />Over the past four seasons, Maryland hasn’t been entirely hopeless. It’s not a total joke of a program that embarrasses the school every time it steps on the football field — it’s not, let’s say, Kansas or anything. Rather, the Terps have shown glimpses of promise, only for nothing to come from it. <br /><br />They had a 25-point lead against Rutgers and they blew it.<br /><br />They were tied with Ohio State in the second half on the road, only to end up losing by 21 in coach Randy Edsall’s final game.<br /><br />They had a 4-0 start in 2016 and received votes in the AP poll, but then won just two of their final nine games to finish with a losing record.<br /><br />The past four years of Maryland football have been immensely frustrating. It’s almost easy to wish the team had gone 2-10 every season and no one got emotionally invested in it, rather than experiencing the ups and downs this senior class has endured.<br /><br />The most recent campaign was perhaps the most frustrating of all. <br /><br />On Sept. 2, Maryland went into Austin and beat then-No. 25 Texas,<br /><br />    51-41. Sophomore quarterback Tyrrell Pigrome looked like a star, passing for two touchdowns and running for another while completing 75 percent of his passes. But he left the game with a torn ACL. <br /><br />While Pigrome’s injury was a huge disappointment, most fans weren’t panicking too much. The sophomore’s backup was freshman Kasim Hill, a four-star recruit who had played high school ball in Maryland’s backyard.<br /><br />But then Hill tore his ACL three weeks later against UCF. Maryland was down to its third-string quarterback before conference play began. <br /><br />The 2017 season is the freshest, so I’ll leave it at that. It only gets worse, and the less anyone thinks about losing to Penn State by 63 points, the better.<br /><br />While injuries and blown leads were two major sources of frustration, something else will stand out when looking back at the past four years of Terps football: the wasted talent — from Yannick Ngakoue and Sean Davis to Ty Johnson and DJ Moore.<br /><br />Maryland’s class of 2018 experienced exciting moments and got to see some very talented players. But all they have to show for it is zero bowl game wins and a total record of 20-30. And that loss to Rutgers.",
    "images": [
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/10/01215805/100116FBvsPurdue_HarrisonIII_mkm01-e1475360666284.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Running back Lorenzo Harrison sprints past defenders for a touchdown as Maryland football beat Purdue, 50-7, at Maryland Stadium on Oct. 1. (Marquise McKine/The Diamondback)"
      }
    ]
  },
  {
    "id": 3,
    "heading":
      "Because of Melo Trimble, the graduating seniors got to see a failing program's resurgence",
    "author": "Jordan Katz",
    "blurb":
      "The past four years of Maryland men’s basketball have been very clearly defined by one person: Melo Trimble. <br /><br />In Trimble’s three seasons at Maryland, the Terps won more than 70 percent of their Big Ten games, never finishing worse than fourth in the 14-team conference. In each of those three seasons, Maryland reached the NCAA tournament, winning three tournament games total during Trimble’s tenure. <br /><br />And although virtually everyone knew of Trimble’s importance, it didn’t truly become evident just how much Maryland needed him until he was gone. <br /><br />While Trimble worked to make his NBA debut while playing for the Minnesota Timberwolves’ G League team, Maryland struggled. The Terps finished conference play with a losing record for the first time in their Big Ten tenure, and their three-year tournament appearance streak came to an end. <br /><br />Above all, Maryland missed Trimble’s poise in close games. <br /><br />In Maryland’s three years with Trimble, it was 21-7 in games decided by five or fewer points. Without him, Maryland fell to 3-8 in the same narrow contests it reliably won with him on the floor. <br /><br />Trimble arrived at Maryland as someone who was seen as the savior of a failing program. For students who narrowly missed the point guard’s arrival, coach Mark Turgeon’s first few years were mostly disastrous. Maryland was in disarray. Multiple players transferred out after a 2013-14 season that saw the Terps finish 17-15, the program’s fourth straight without an NCAA tournament appearance. <br /><br />But because of Trimble, the class of 2018 was used to winning seasons. When he was here, students never felt real anxiety on Selection Sunday and witnessed the program’s first Sweet 16 in more than a decade. <br /><br />Despite a forgettable senior season for this year’s graduates, the class of 2018 got its fair share of highlights: a 2014-15 season that saw the program rise back to national prominence, the iconic flash mob against top-10 Wisconsin that ended with a court-storming, the Terps skyrocketing to No. 2 in the country during the most hyped season in recent memory, a Sweet 16 appearance. It also got to experience the building of new rivalries and the resurfacing of old ones (the Georgetown games stand out when looking back). The current graduating class never saw Maryland play Duke in Xfinity, but got to enjoy games against historical powerhouses like Michigan State and Indiana. <br /><br />Along the way, Trimble provided multiple highlight reel plays, like his his dazzling, ankle-breaking play against Michigan State’s Tum Tum Nairn, or his game-winner against Wisconsin on the Badgers’ home court. During his final season, he helped Maryland claw its way out of out of almost every close game it played, most famously with his final shot in Xfinity Center: a game-winning three over Michigan State.<br /><br />Despite the relative success, the impending graduating class has also experienced its fair share of frustration. The hyped 2015-16 Terps were a confounding group. They did not win the national championship, or even make the Final Four like many predicted before the season, and finished ranked No. 18 in the AP Poll after spending multiple weeks in the top five. Trimble had lost some of his explosiveness, and opted to return after what most assumed would be his last season. <br /><br />Trimble’s final season featured the young but talented supporting cast of Anthony Cowan, Kevin Huerter and Justin Jackson — a significant drop in talent compared to the previous year. A promising 20-2 start before a late-season skid and early tournament exit left a sour taste in Maryland fans’ mouths, and the 2017-18 season was often infuriating.<br /><br />Trimble’s legacy at Maryland, just like the past four years, is complicated. He helped get the program back on track and returned it to national relevance. At the same time, it’s difficult to feel like just one Sweet 16 and three NCAA tournament wins in three seasons isn’t a bit of a letdown considering Trimble’s talent and the talent that surrounded him. Regardless, seeing what Maryland looked like without him has cemented his importance to the program.<br /><br />When this year’s graduating class looks back on what Maryland men’s basketball was like when they were students, it’ll have plenty fond memories with a decent amount of disappointments. But there’s one person who will stand out in their mind more than any other. It’s Melo.",
    "images": [
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2017/03/06231625/030417MBBvsMSU_Trimble_sms05-e1489630899725.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Melo Trimble celebrates his game-winning basket at Xfinity Center on March 4. (Sammi Silber/The Diamondback)"
      }
    ]
  },
  {
    "id": 4,
    "heading": "The evolution of Dining Services",
    "author": "Hallie Miller",
    "blurb":
      "At 3:15 p.m. on a Wednesday, the South Campus Dining Hall buzzes with the busy sounds of fingers clicking keyboard keys and casual chatter among friends. On one end, a student with headphones bends his head over a textbook. On another, a group in lettered jackets jeers at a sporting event on television.<br /><br />On the surface, it looks like another ordinary day in the dining halls. Aside from the addition of a new vegan station, the shift away from the points system and the reshuffling of cashiers from the middle of the room to the entrances, nothing indicates a divergence from the ordinary.<br /><br />Dining Services not only sought to improve their efficiency and responsiveness over the past four years, but also looked to breathe new life into campus culture.<br /><br />Yet, most students don’t seem to be appreciating the intent behind those changes.<br /><br /><span>Carry out no more</span><br /><br />The grievance students vocalized most frequently was  Dining Services’ new policy restricting students from taking their food to go.<br /><br />The new system, though unpopular among students, has minimized the number of single-use items that go through the waste stream each year. <br /><br />Students like freshman environmental health major Ryan Regars said the system should be more flexible.<br /><br />“The other day, I tried to take an apple and a banana out, but it’s just not happening,” Regars said. “It sucks.”<br /><br />Students wondered why more limited portions or self-bought, reusable carry out containers were not permitted out of the halls. But Dining Services spokesman Bart Hipple said the current system better reduces the chance of waste.<br /><br />“People would be feeding other people,” Hipple said. “That’s an exposure to loss for us.” <br /><br />Calling it a win for sustainability, Hipple said he’s proud of the changes.<br /><br />“We had to get rid of carry out,” he said. “I see so many benefits to it. When I walk through a dining hall I see students sitting and talking, not standing in line, waiting, paying and leaving.” <br /><br />Hipple said this more natural, organic approach to dining lends itself to the establishment of healthy patterns, including taking the time each day to eat with others. <br /><br />“I really do believe that’s a better way to be,” Hipple said. “The alternative is for the next 60 years, you’re going to eat out of cardboard boxes in front of screens? Really?”<br /><br />Hipple said students can now enjoy board games like Connect Four, chess and checkers in the dining halls as well, another effort that promotes unwinding and communicating with others.<br /><br /><span>Variety shows</span><br /><br />When it comes to the quality and types of food offered, students like freshman computer science major Krish Gaglani said the options proved to be mediocre at best.<br /><br />“The chicken tenders are good, that’s the highlight,” he said. “But everything else, it’s not too bad, but it’s not great either.”<br /><br />Irritated by the lack of options, students said they find the food mundane and often opt to spend money elsewhere.<br /><br />“I just avoid coming here,” said sophomore public health science major Sibga Sufian. “It’s not worth it to come here when I can go to Route 1 and get something and bring it back to my room.”<br /><br />Sufian, who doesn’t eat meat, said it’s especially hard for her to balance a sustainable diet.<br /><br />“The vegan station is nice, but it’s tiring to have the same thing every day,” she said.<br /><br />Hipple, though aware of the criticism — especially concerning the disappearance of specialty items such as the daily buffalo chicken wraps — said the current menu allows for quickness and efficiency.<br /><br />“We don’t have the bandwidth or capacity to have every sandwich available,” Hipple said. “We can’t have them waiting for custom items and also get food quickly.”<br /><br />And while students like Regars said the dining halls should open earlier and close later to better accommodate student schedules, especially on weekends, Hipple said it conflicts with staff scheduling and logistics.<br /><br />“We’re very aware that many staff members rely on public transportation to get to and from work,” Hipple said. “We’re also aware that we’re an essential service to over 900 students.”<br /><br />To better provide for freshman connection students — who live on the campus but whose Monday to Thursday classes take place at some point from 3 p.m. to 9 p.m. — Hipple said he implemented longer dinner hours and did away with late-night dining.<br /><br />“In order to provide good, nutritious meals to all students, the solution would be to serve dinner until the end of the day and have mozzarella sticks and chicken tenders as weekly specials,” Hipple said. “It’s healthier all around.”<br /><br />Students who commute to and from campus will also now have more dining plan options at more affordable rates, Hipple said. Though students without meal plans can purchase dinner for a flat rate of $15.95, Hipple said that rate should go down to $9 or $10 by fall.<br /><br /><span>Full circle</span><br /><br />Like most features of large, public universities, the dining halls may not ever please every student enrolled. Hipple said he wished he could be more receptive without compromising on the gains made.<br /><br />“We took the blame for [the complaints<br /><br />    ] in a way I don’t think is quite fair,” Hipple said. “People seem to be enjoying themselves more and you can tell it’s lowered tensions in the dining halls.”<br /><br />But with midterms, deadlines and due dates looming, the South Campus Dining Hall seemed about as tense as expected for a late afternoon in mid-March.",
    "images": [
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/01/28015138/images.washingtonpost.com_-e1453963711401.jpeg&mode=crop&w=1200&q=99",
        "caption": "The front of South Campus Dining Hall."
      }
    ]
  },
  {
    "id": 5,
    "heading": "An ode to the jumbo slice and late-night pizza",
    "author": "Hallie Miller",
    "blurb":
      "On a Saturday night in late February, a small group of my friends and I braced the frigid wintry chill in search of something that makes such a trek worthwhile — a slice of heaven in the form of a fat, dripping, jumbo-sized triangle.<br /><br />Following an evening of rowdy drinking and dancing (which is obviously acceptable when you’re a second-semester senior with fewer than 100 nights like this until It’s All Over), we decided to splurge on a late-night snack of sorts. And because one of us was hosting a friend from another university, we felt compelled to show her the best of our school and the quirky little town in which it resides.<br /><br />Welcome to College Park, where pizza is king.<br /><br />The options are seemingly infinite. Within walking distance from the bars stand every kind of pizza conceivable, from large pies to create-your-own masterpieces to cheesy bread (which, when served with marinara sauce and a teensy bit of garlic, is a shareable substitute that I argue is just as good as the real thing).<br /><br />When a newcomer passes through, you don’t just want to play the pizza game safe with a widely recognizable chain-brand contender. That eliminates Blaze, Ledo’s, Domino’s, Papa John’s, Pizza Boli’s and Pizza Hut (a schlep and a half, if you ask me) right off the bat. Venturing outside of the conventional, you want them to have the kind of experience they’ll take back with them to their own schools and keep situated in the depths of their appetite for, well, forever.<br /><br />So we went the jumbo slice route, to Pizza Kingdom. And it was worth it.<br /><br />The beauty of the massive slices, aside from the taste factor, is the element of recklessness that accompanies the journey of indulging in them. Some of the jumbos available in the neighborhood don’t even fit inside the standard personal pizza box, requiring that the bottom end of the triangle folds over into a new triangle flap situation of its own. <br /><br />In terms of snack food, it’s a pretty good deal. At $5 before tax, it’s about half the price as a medium pie, and you still feel like you get the bang for your buck. Eating the behemoth is an adventure, requiring more than one napkin and at least one or more packets of ranch dressing if you’re sensible.<br /><br />Under normal conditions, the average person wouldn’t feel so great after eating a jumbo slice alone. It’s not the kind of thing I would expect anyone to attempt on, say, a random Tuesday at noon.<br /><br />But under the right conditions, it’s the perfect end to a night out. It’s daring. It’s extreme. It’s kind of irresponsible.<br /><br />But that’s college, isn’t it?<br /><br />Pizza Kingdom, Terrapin Pizza Mart and Slices Pizza Co. all opened in College Park over the course of the 2013-14 academic year. They’ve since gone on to dominate the late-night pizza scene, at least as far as my friend group is concerned.<br /><br />Pizza Kingdom owner Ali Farhad said he sees the most business starting on the first night of the College Park weekend, on Thursdays, which continues through the Saturday late-night rush.<br /><br />For him, staying viable in this heavily concentrated pizza environment requires simply staying true to the foundation of good pizza.<br /><br />“It’s the product,” Farhad said. “It’s the ingredients and the sauce and the cheese.”<br /><br />But strangely enough, when we decided where to go that night, we didn’t necessarily care about the quality of what we consumed. A lot of it had to do with proximity to where we lived.<br /><br />“Pizza Kingdom wins for convenience,” my friend and fellow senior Jackie Gropper said. “But Slices is better, hands down.” <br /><br />It’s entirely possible that had Slices Pizza Co. occupied the same space as Pizza Kingdom, we would have spent our $5 on a smaller, more gourmet-style slice. But whether it was the element of convenience, or the size or the taste, Pizza Kingdom won our business that night.<br /><br />So many nights in my college experience ended with a bite (or 12) of pizza or, at the very least, a longing gaze at someone else’s before I fell asleep. Sometimes it’s one of the last things I remember seeing or doing before I shut my eyes, before putting the joys, the terrors and the heightened emotions of the evening forever behind me. Several times, those moments covering a jumbo slice in ranch next to my best friend was the best part of the night, or a motivator to make it out again in the future.<br /><br />As my friends and I prepare to let go of the past four years, I hope the rowdy nights spent together and capped off with a slice of something special remain central to our memories.  I also hope that wherever we end up next, there’s late-night pizza nearby with a similar ability to make the good nights even better or cure the broken hearts when they break.",
    "images": [
      {
        "url":
          "https://images.washingtonpost.com/?op=resize&url=https://s3.amazonaws.com/wapopartners.com/dbknews-wp/wp-content/uploads/2016/02/02002948/032615_PizzaKingdom_jcl02.jpg&mode=crop&w=1200&q=99",
        "caption":
          "Pizza Kingdom is one of the nine College Park restaurants offering discounts on the Spotluck app. (File Photo/The Diamondback)"
      }
    ]
  }
]
